---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedTransparent.TransparentDistance
source: html/972864f0-28cb-ad77-4271-fe53414d99c3.htm
---
# Autodesk.Revit.DB.Visual.AdvancedTransparent.TransparentDistance Property

The property labeled "Transparent Distance" from the "AdvancedTransparent" schema.

## Syntax (C#)
```csharp
public static string TransparentDistance { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".